samples/action_enc.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EK-f20bddc9-a856-4ade-9a7d-e22cce4acddf"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=equidadtes</ds:X509IssuerName><ds:X509SerialNumber>662525258</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>a21XzwYh9iW+jU2wcmS8clZb7lTwO8XqGhpT5A6udBfJuK2GyskMF7DU2kYTF/jM1duF02Yujp3I&#xd;
A3+smzKoVL+7wAnV12LOQIFhiIMzeiJvu1SfdjrOKqxr6qCE1fBEThYGm9/ER6CVrctbaQFtlrHv&#xd;
l37N55gptXvThZMmu4eA58PeIOugjhjAaLkvZl6CoodnbpZ7BHuvPvdwzLzkietoD3jJoJe36zRW&#xd;
uRd8uumr77NBcEdWz4vsM+wNuZBSzDXcrlPPgVRiuYsGa9I8W7QvuTnHlmCbHOK8YWVjGD7aMzvW&#xd;
qyjUwfoeEyxtW9dwqEixH/dt4zIs6N4nbzQGrg==</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#ED-20d7bc4e-d5d7-41d9-abf7-e66f27d660ed"/><xenc:DataReference URI="#ED-98df34a4-9c8b-4856-b566-e2e866fe276b"/></xenc:ReferenceList></xenc:EncryptedKey><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-6efe5356-3be0-448b-ae66-11a66c7e8c7b">MIICyTCCAbGgAwIBAgIEJ31VSjANBgkqhkiG9w0BAQsFADAVMRMwEQYDVQQDEwplcXVpZGFkdGVz&#xd;
MB4XDTIyMDYyMzE2MTY1OVoXDTIzMDYyMzE2MTY1OVowFTETMBEGA1UEAxMKZXF1aWRhZHRlczCC&#xd;
ASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALefDaGZ7rNRFKoFph42+O6f5y6/X8p5PCqV&#xd;
F91zMs2S4Zw3QkMbglAw6IQ1a5wurob9gOcUJxyUL7rgk8QxAJKBsmnZtihsL1LXOodUB06DYSm7&#xd;
YbU6Kr8t/zq2E2MvR1J9RxaZroGjuj9peobxxgWPudMJS7fv+s4tSGPbrRWdFZErKNrZExByuuWx&#xd;
mvE3UDJW1dCt+y++tHS3uixWBwmiBHTjp0rxYFkEhFtZiIHXSFqO27R9GVF0k5UB3+JPZjFZSuoH&#xd;
Cr3BDySeZtX3d7TIfx117uAMF/m6lWFyEZRLGEGc4LI+ggs/ckPQ1Nb/kpkhMi9lfEieGi2OZo/a&#xd;
q/cCAwEAAaMhMB8wHQYDVR0OBBYEFKMQCFZmYnPqG2N6xa8Ly7lHYsEKMA0GCSqGSIb3DQEBCwUA&#xd;
A4IBAQCf0JXSq7ULOSY+/YN+uAPWEyJA9JP/0cGtsFN5bakLc8eH8/0uZsprU/FbN8iGIDGJha0W&#xd;
iJgpR7MpDpvBy9NBEfg7Xea1jTmlEtikvBKCCU+8Bs3wcPTMQFrBbjTgfsSuDk6NEYcwLhTWzlTL&#xd;
48hh/eAwP6VHMPNHSOyRRDGMfPE9kC0ZgMRpCbWhiuLdwbWL2zBkDGU+BMc8oB/nBjuFFTnBCpuF&#xd;
AT6abRnSBwRT66gneQYxAaSVWWey73p116aayVSxCz0fbKvOqvtNorvLWGLntTiNk7lk5bTGjsR0&#xd;
lpM6G5hZwsnFqr6U3DWpPK8TmYpiCpbP6G2LPH12qCMZ</wsse:BinarySecurityToken><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="ED-20d7bc4e-d5d7-41d9-abf7-e66f27d660ed" Type="http://www.w3.org/2001/04/xmlenc#Element"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"><wsse:Reference URI="#EK-f20bddc9-a856-4ade-9a7d-e22cce4acddf"/></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>fVkiBUg4E+VJ7z2gwe/ZVYNVtLe4OvKgPWQ3IpqWOD406dRHN4PV+2IFVoqOHomNw8RW213b1l0O&#xd;
XFFtq3RiXYmqUoomCcsOBU6EWzrYQfOIqu9n+i7WXxh+7rMERELBbYkicL0qfCTYrjEKatImJe4e&#xd;
qtPp4gMEEKo5L1QHU92SI6EhY4zKwGwoeiLUNltKLqOs4DLbLobHxNSURl58UxBDB3YfYLN9SOGJ&#xd;
CAYaAf3NmlvEzZQt5MYK1qNBrDjFFWdwvIXiWz8n4JPSlxblJoxa97pk0lojI129A4AcTr8PlqoR&#xd;
SEnNuM+3XIFITN7KE+3NsMFhao7Q0O+m1dySJzGSbHXSsiLTdvJlkq81X0dYBM/uoNHXwSggsJFU&#xd;
7RHhE3CFoC4CZgMhK3ZkgqBe37Z4VhtigPhUCCDoJpxjJlwuLHYi7++Ab7JuNchjpPJYKVgKKBlH&#xd;
BidTFh7yYiAoObUn2xTpzUFpLTJWK+z7RZ8viNFDyxq/b1SAaCDAbWQiLFP8nVs9B7JsxjOZ2Jgd&#xd;
gRb1BIM+kZ+ZCHm4xKpdbQDVZ0tm8M6XVZtsJp7aVrZ6vHlcfLblO1iyzJ5Y3pMHlHd7sH7RfZfy&#xd;
29HzaMciEc8NdhulqKsDOWizDKm0oAy1YDn4K8AxEr6rgO2GbnTopheoSVVUOXcT/VCyYWFazxa+&#xd;
1HEkED1KtJXj8qjLnfO/GzcRMYSkE+/000raBKZgLkDqpP0a0q0yOV+j2CYrvVA4IdOgMEuNtD6s&#xd;
xxmiPUQWcKW+xbuJG04nEH/f2sxLAax9N7sNAT5RRHU1G2nqGHeMY3zwHe8Pbj0TQbxifrX22vLR&#xd;
2sY6xAGx9F6RpnQuLAA7WUYSxM1GZ09PfIowE2gek2n6cvuBsrhQGLt/rN2k50trlA/1JPpJ84EJ&#xd;
Wzv7gx6Iq+fWQnsx0Z7FVZ2fG5C1lxi/lz0K65QDUqzBHIwaMD88w8kTYVxawRvtvxOsid4kGHLP&#xd;
1oFeEItGBWGecHj9P2SQ3fM0CqedaT3CRUbeXSK0r5uuTr314bg+elRTlrnEew4fEltNv4GeM13A&#xd;
mG4I1xbGdBEhmzwYPxv+dY+46KMAu+gaCZk9QCFWfPzC/jl6JcV9C+RfTKnVkPGyqvhVK08LqulI&#xd;
ZBO4oaLNURw4Dogqxwf+wcfgVqezHdHZDaKwEYd1+whLx7vMhwF30Fu3GKA5iyqSjiXg7LiNjZkg&#xd;
k4XyaACHOZWF7qbujq0UN/WCKgfUvGZDVGXCin6D8ogvnIWVUSDEqau7afockGIJNbM4STImo8j+&#xd;
AAEcIwH3q7hjBS9YTBqMfsQgda9GqzvTSkHjuYH0FX7DkpH65lG4IAIm7QdyuCPt6dqh9dOAO219&#xd;
2hEwcYr6y9/5fmD5uDz20jEMDZp6qsu39lBEIhebJ3F2Jl5Fa4f2hVva42JFsvPLvCW5XMCvIHrZ&#xd;
e0fBaX2tcaq8GdQSOaDTez8a09ULR6VXfaThU3tBylyOcLjUqYWN8rLXFB6KZY2mqIBTvwvUeZN6&#xd;
W4xfQmMDDDwTuCxdIC4R9syuHeafzRS+Zz/i3QDEbVJHu4t1ci6j57rmj/P3zYq00T0Wgxyajvg8&#xd;
i2Xcs8Q+R7UT436DIncORRYqk4WZRnmAZzb6KnEliB98P/KIWl0Uxlf41DM0U4koh0ZcQU/Wfk/0&#xd;
6LA7h+afv0D6hdRcBlj3WESewJUeL/2+BriK8ipzbg5bgfVED+U7pNQDfGPePGimTwL2lYQh3To9&#xd;
V7AEpmwsve7vzyDJ8JYxRGXKmnqVqQKVqWYB34/V375Bi8cBr2/zeeS+ZLx8nheydNDG/Q+rI2WA&#xd;
677tkDux0KurdjHJqzJgROeSWuj+N2BzApY+h5R7Qb/M3ds998WWGbftAozCBdwaePDfM3pWByj+&#xd;
0pJ65KKUABKF8cmVy/4Q2enPDoTyWBm+LttKr4dxvacLp97JEiVFfPDhlh391TcfzY5NjsK50VD4&#xd;
9bXVsB/KzrvGvI88SQc+Eukar3jwXglwyq8Zh9UJRbDtaD3pucB21rSupY8CvzvBcVbeYL/WiWlU&#xd;
2MGF1jAQunEKGo5FzRcE3+aE6NvZA+73ngbBNieTL/syHqMALyToOIzJWNslkvldr713cZpeOBSM&#xd;
FYEKF2oVxS0ZEM5de+6TJ9a51+Fu9kt+BeJswOJr1VwXS0jCmGQolBLaPuktbKCZJ9VfAntypAUB&#xd;
Su8d8LVQqilYky0NIanQ32kMFVzv/QqO7liZIU+Z2Qx5VgtHbOqi5ItYMjzjimgRk4NvH8QFzGmy&#xd;
nCYYwoilMIx8KXrYT6OBNhfR7lP850tzHsTdY2/r07HFi1v16pONslzLlJCfOt7vDlaUVE0bteo0&#xd;
+r9KHIhXmdaokphB0auCjTWThmKQ+21mtWhr+UDWgldCJDEl9/ECvXUDw5W03M11mKaQLBpRKdrK&#xd;
072vv5iFe8DmQxY728G6xISgwbmo42qGwJK1O+a+XgL/2ZPn12ZGioFSxdrS9vRuNUeDwL+igGdH&#xd;
0Gs3CZiF+/QJ46Jcqz6vpUvr2p3uSLghOgjGf8OyE++p/bPQfPoAfZvNa4GmTNTIcETFUIeO0IMu&#xd;
prEX55bVQ5iSZJeeJ5f9/d7aNLaFAMSB47opK9LUGADofgA/subQmu4x6tw+lalUb+p/+sUDqOyS&#xd;
vXgecd39K8jGZZLiMIBbDcFCb3b4NbNSgbml1sFfOcI0Mb6yIgntGXUFphmJ53yZjzHsxj2crO9l&#xd;
JIFUeRfR4EwlaMUKHfQNKMCPnw3XkQM+AiKdib4TnW8vJP7eakjnuPmj+4rx7dh5vg3/VQZ5nhBr&#xd;
R6tEQaxBaH0q7H3yHxPmWFDWaqcFrLR6g8HY54Rl4xA3lzdCbexThcR4tWOi+t9+/fD5xrgpWGLB&#xd;
8CMgbK2D4C4KDf9n2Ix8hcbl1WYMibR1AFz/aUA93Ac2BmH86qYD6qmB7+asgB+KKwHpzA+W5gVk&#xd;
IKxFTVLqBV1e</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData><wsu:Timestamp wsu:Id="TS-1f55d30b-e1ac-4c01-8e82-57f44a024b96"><wsu:Created>2022-10-01T05:54:08.339Z</wsu:Created><wsu:Expires>2022-10-01T05:59:08.339Z</wsu:Expires></wsu:Timestamp></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-57b6328e-d5fe-4bff-bbd7-ce6866c13e30"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="ED-98df34a4-9c8b-4856-b566-e2e866fe276b" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"><wsse:Reference URI="#EK-f20bddc9-a856-4ade-9a7d-e22cce4acddf"/></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>GOZz16Id9JSMi7VrfJZSVCfl70ybbxIMJwXp1Qh4TloRfFFr/Hy9RF5L54MbQ+RJDBld885hrFMD&#xd;
ZKBaHITSgf/wEEI4gzl1cWVb82VeKezYELl7F7o+0kjF1FMTWT+SjCekOLMeyW2tGV49c38z8/8V&#xd;
cDt/YhaNaNVWqw6jhI2qIIU0sZJM3IT/nNAElFKaumIBcrEiaFdVlgC/T7JjcJ/EfCs/bOQy/uMh&#xd;
svUiv+H9FtdCLQcW1DJiYfblYEcPgKh9FlTqL8MkKRldPoipqEW6FciSEZ9ej9s6MFPV0ZLfUhOa&#xd;
SvwAuZlqxzjM3vgMLCLJZWNMNGByYiuUk2CZhddo9hf/09CSqScSP3srk25IpmMI8dpv4rcq8kpV&#xd;
Tvz7Vc/WhjmFN7yMmud0JPeC6S4a/8NHQTmhqecKvLqmGNq6VpSYED8WzIrnx6vSbDXTmoFvcXGW&#xd;
1r9t/eX+p9WQrkSdzk3vngt+RJZKWG8HNm7sakU5ceS3cuVp0g0J8wqvtyrDQ955gAEWTIrCAKsY&#xd;
VBM/55w8OTLfUl1RpGFWXlPQiChFte8d4x0w4Cdg+V8DdDPYTeunJ7tDwRE1hRHE6yXfEZSh7I4t&#xd;
RcwsknUlf96MexQvKk2SrZ2eyw68A2WDcFtlcBJGy0I3Au6vRu98Pl6CVTING9LJnlbVGxC3j7Xi&#xd;
RxLefGXHXqDg6X2e8CbT</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soap:Body></soap:Envelope>